zephyrproject-rtos/zephyr/ext/hal/atmel/asf/sam/include/sam4s/pio/sam4sd32c.h
#define PIO_PA17_IDX        17
#define PIO_PA18_IDX        18
#define PIO_PA19_IDX        19
#define PIO_PA20_IDX        20
#define PIO_PA21_IDX        21
#define PIO_PA22_IDX        22
#define PIO_PA23_IDX        23
#define PIO_PA24_IDX        24
#define PIO_PA25_IDX        25
#define PIO_PA26_IDX        26
#define PIO_PA27_IDX        27
#define PIO_PA28_IDX        28
#define PIO_PA29_IDX        29
#define PIO_PA30_IDX        30
#define PIO_PA31_IDX        31
#define PIO_PB0_IDX         32
#define PIO_PB1_IDX         33
#define PIO_PB2_IDX         34
#define PIO_PB3_IDX         35
#define PIO_PB4_IDX         36
#define PIO_PB5_IDX         37
#define PIO_PB6_IDX         38
#define PIO_PB7_IDX         39
#define PIO_PB8_IDX         40
#define PIO_PB9_IDX         41
#define PIO_PB10_IDX        42
#define PIO_PB11_IDX        43
#define PIO_PB12_IDX        44
#define PIO_PB13_IDX        45
#define PIO_PB14_IDX        46
#define PIO_PC0_IDX         64
#define PIO_PC1_IDX         65
#define PIO_PC2_IDX         66
#define PIO_PC3_IDX         67
#define PIO_PC4_IDX         68
#define PIO_PC5_IDX         69
#define PIO_PC6_IDX         70
#define PIO_PC7_IDX         71
#define PIO_PC8_IDX         72
#define PIO_PC9_IDX         73
#define PIO_PC10_IDX        74
#define PIO_PC11_IDX        75
#define PIO_PC12_IDX        76
#define PIO_PC13_IDX        77
#define PIO_PC14_IDX        78
#define PIO_PC15_IDX        79
#define PIO_PC16_IDX        80
#define PIO_PC17_IDX        81
#define PIO_PC18_IDX        82
#define PIO_PC19_IDX        83
#define PIO_PC20_IDX        84
#define PIO_PC21_IDX        85
#define PIO_PC22_IDX        86
#define PIO_PC23_IDX        87
#define PIO_PC24_IDX        88
#define PIO_PC25_IDX        89
#define PIO_PC26_IDX        90
#define PIO_PC27_IDX        91
#define PIO_PC28_IDX        92
#define PIO_PC29_IDX        93
#define PIO_PC30_IDX        94
#define PIO_PC31_IDX        95

#endif /* _SAM4SD32C_PIO_ */
